src/cf/InformationRegisters/эв_ОчередьЗапросовСпасибо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>эв_ОчередьЗапросовСпасибо</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>end_point</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>service</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>body</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>http_status</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>send_limit</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Терминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заголовки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>metod</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗапроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/эв_ОчередьЗапросовСпасибо/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ОтправитьНаСервере(ТД)
	// Вставить содержимое обработчика. 
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("ИдентификаторЗаписи", ТД.ИдентификаторЗаписи);
	СтруктураЗаписи.Вставить("end_point",           ТД.end_point);
	СтруктураЗаписи.Вставить("service",             ТД.service);
	СтруктураЗаписи.Вставить("body",                ТД.body);
	СтруктураЗаписи.Вставить("http_status",         ТД.http_status);
	СтруктураЗаписи.Вставить("send_limit",          ТД.send_limit);
	СтруктураЗаписи.Вставить("Терминал",            ТД.Терминал);
	СтруктураЗаписи.Вставить("ТекстОшибки",         ТД.ТекстОшибки);
	СтруктураЗаписи.Вставить("metod",               ТД.metod);
	
	Ответ = эвСберСпасибоСервер.ОбработатьЭлементОчереди(СтруктураЗаписи);
	
	МЗ = РегистрыСведений.эвОчередьЗапросов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, СтруктураЗаписи);

	МЗ.http_status = Ответ.http_status;
	МЗ.ТекстОшибки = Ответ.ТекстОшибки;

	МЗ.ДатаЗапроса = ТекущаяДатаСеанса();
	МЗ.send_limit  = МЗ.send_limit + 1;
	МЗ.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ТД = Элементы.Список.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	ОтправитьНаСервере(ТД);
КонецПроцедуры
